Revit 2025 API
OccupancyUnit Enumeration
 An enumerated type listing the occupancy unit of measure for a space object.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum OccupancyUnit
Public Enumeration OccupancyUnit
public enum class OccupancyUnit
type OccupancyUnit
Members
Member name | Value | Description
NumberOfPeople | 0 |  OccupancyUnit is NumberOfPeople.
AreaPerPerson | 1 |  OccupancyUnit is AreaPerPerson.
BySpaceType | -1 |  OccupancyUnit is BySpaceType.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace